{
  "date": "2025-06-30",
  "note_type": "daily",
  "title": "Daily Note - 2025-06-30",
  "summary": "An incredibly productive day focused on major architectural changes to the Collapsi project, transforming it into a standalone web application. Significant progress was made on AI integration, MCTS improvements, code quality, and AlphaZero implementation, along with setting up Tailscale and a hierarchical note system.",
  "topics": [
    "web-architecture",
    "javascript-porting",
    "mcts-optimization",
    "alphazero",
    "onnx",
    "policy-value-consistency",
    "client-side-development",
    "Reinforcement Learning"
  ],
  "projects": [
    "collapsi-web",
    "collapsi-alphazero",
    "hierarchical-notes"
  ],
  "people": [
    "Mark S. Ball"
  ],
  "institutions": [],
  "methods": [
    "Monte Carlo Tree Search (MCTS)",
    "AlphaZero-style training",
    "Policy Distillation",
    "Temperature-based Exploration",
    "ONNX conversion"
  ],
  "tools": [
    "javascript",
    "onnx",
    "pytorch",
    "tailscale",
    "localStorage",
    "webstorage",
    "CUDA",
    "CLI"
  ],
  "accomplishments": [
    "Refactored Collapsi to a standalone web architecture, removing backend dependency and enabling 100% client-side operation.",
    "Created complete JavaScript port of game logic and environment wrapper.",
    "Implemented save/load system using localStorage and JSON.",
    "Extracted MCTS into a standalone module supporting PyTorch and ONNX.",
    "Created ONNX conversion script reducing file size by 60-70%.",
    "Integrated AI opponent into web UI using ONNX runtime.",
    "Fixed MCTS performance issue by preventing instance creation per move.",
    "Cleaned up code by extracting common evaluation logic and creating a centralized state preparation helper.",
    "Made PPO hyperparameters configurable via CLI.",
    "Built a complete AlphaZero-style training system, including policy distillation and temperature-based exploration.",
    "Improved CUDA detection and logging.",
    "Created proper session-based checkpoint management.",
    "Set up Tailscale for secure networking.",
    "Created hierarchical note template system (Daily → Weekly → Monthly).",
    "Documented all changes comprehensively in README and CLAUDE.md."
  ],
  "insights": [
    "Observed a policy-value consistency gap during AlphaZero training: policy loss decreases while value loss remains high, suggesting the policy might be memorizing MCTS patterns without true understanding.",
    "Identified a potential solution to the consistency gap: adding a consistency loss term to enforce V(s) ≈ expected value following the policy.",
    "Recognized major benefits of standalone web architecture: zero server costs, instant deployment, better performance (no network latency), offline capability, and simpler development workflow.",
    "Discovered that MCTS instance creation per move was a major performance bottleneck."
  ],
  "learning": [
    "Learned from various code review feedback on RL training patterns.",
    "Watched Mark S. Ball's Collapsi tutorial (and integrated it into the UI).",
    "Discovered that MCTS instantiation per move was a major performance bottleneck, leading to significant optimization."
  ],
  "challenges": [],
  "future_work": [
    "Test the AlphaZero training with full 1 million episodes.",
    "Implement the policy-value consistency loss experiment.",
    "Create more sophisticated AI difficulty levels for the web UI."
  ],
  "metrics": {
    "onnx_file_size_reduction": "60-70%"
  },
  "papers": [],
  "file_path": "/home/artnoage/Projects/interactive_cv/raw_data/personal_notes/Daily Notes/2025-06-30.md",
  "extraction_date": "2025-07-05T18:13:36.620192",
  "extractor_version": "blueprint-v1.0",
  "document_type": "personal"
}